export default {

  //Side drawer
    initiativeMap: 'Мапа ініціатив',
    myInitiatives: 'Мої ініціативи',
    projectLibrary: 'Проектні пропозиції',
    resourceLibrary: 'Локальні ресурси',
    settings: 'Налаштування',
    feedback: 'Зворотній зв\'язок', 
    language: 'Мова',
    en: '🇬🇧',
    uk: '🇺🇦',
    ka: '🇬🇪',
    fi: '🇫🇮',

    //App bar
    enter: 'Увійти',
    exit: 'Вийти',
    loading: 'Завантаження',

    //Project Library
    projectLibraryTitle: 'Бібліотека проектних рішень',
    myProjectsTitle: 'Мої проектні рішення', //when adding project to inititiative
    onlyMineCheckbox: 'Показати лише створені мною',
    noMyProjects: 'Ви ще не створили проектів{#choice у бібліотеці | за даною категорією#}.',
    noProjects:  `У бібліотеці поки що немає проектів{#choice | за даною категорією#}.
    Будьте першими хто їх додасть.`,

    //categories of projects
    chooseCategory: 'Оберіть категорію',
    allCategories: 'Всі категорії',
    greenery: "Озеленення",
    publicSpace:"Громадські простори",
    domestic:"Побутові",
    recreation: "Відпочинок",
    help: "Допомога",
    art: "Мистецтво",
    business: "Бізнес",
    other: "Інше",

    //Form controls
    add: "Додати",
    addAndJoin: "Додати та приєднатися",
    cancel: "Відмінити",
    back: "Назад",
    next: "Далі",

    //Feedback form

    //User form

    //Project form
    projectAddCoverPhoto: "+ Додайте титульну картинку",
    projectName: "Назва вашої пропозиції",
    projectContractor: "Виконавець",
    projectContractorLocation: "Локація",
    projectChooseCategory: "Оберіть категорію проекту",
    projectProblem: "Яку проблему він має вирішити?",
    projectDescription: "Опишіть проект:",
    projectContractorExperience: "Який маєте досвід для реалізації?",
    projectOtherResources: "Які негрошові ресурси необхідні?",
    projectNumberOfVolunteers: "Скільки волонтерів вам буде потрібно?",
    projectVolunteerTasks: "Які задачі мають виконувати волонтери?",
    projectMinimalBudget: "Який мінімальний необхідний бюджет?",
    projectBudgetCovers: "Які витрати має покривати бюджет?",

    //Initiative form
    initiativeInstruction: "Рухайте мапу щоб навести відмітку ініціативи (червоний маркер) на необхідну локацію, додайте назву і натисніть Далі.",
    initiativeName: "Назва вашої ініціативи",
    initiativeAddCoverPhoto: "+ Додайте титульне фото",
    initiativeProblem: "Яку проблему має вирішити ініціатива?",
    initiativeExpectedResult: "Опишіть очікувані результати:",
    initiativeCurrentState: "Передумови для реалізації:"
};