export default {

  //Side drawer
    initiativeMap: 'Мапа ініціатив',
    myInitiatives: 'Мої ініціативи',
    projectLibrary: 'Проектні пропозиції',
    resourceLibrary: 'Локальні ресурси',
    settings: 'Налаштування',
    feedback: 'Зворотній зв\'язок', 
    language: 'Мова',
    en: '🇬🇧',
    uk: '🇺🇦',
    ka: '🇬🇪',
    fi: '🇫🇮',

    //App bar
    enter: 'Увійти',
    exit: 'Вийти',
    loading: 'Завантаження',

    //Project Library
    projectLibraryTitle: 'Бібліотека проектних рішень',
    myProjectsTitle: 'Мої проектні рішення', //when adding project to inititiative
    onlyMineCheckbox: 'Показати лише створені мною',
    noMyProjects: 'Ви ще не створили проектів{#choice у бібліотеці | за даною категорією#}.',
    noProjects:  `У бібліотеці поки що немає проектів{#choice | за даною категорією#}.
    Будьте першими хто їх додасть.`,

    //categories of projects
    chooseCategory: 'Оберіть категорію',
    allCategories: 'Всі категорії',
    greenery: "Озеленення",
    publicSpace:"Громадські простори",
    domestic:"Побутові",
    recreation: "Відпочинок",
    help: "Допомога",
    art: "Мистецтво",
    business: "Бізнес",
    other: "Інше",

    //Feedback form


};